docs: add design doc for ending tx concurrently
