--- a/docs/internal/tx-state.md
+++ b/docs/internal/tx-state.md
@@ -42,35 +48,46 @@
-[状態遷移マトリックス](#状態遷移マトリックス) の主な部分を下記に示す(すべてを記述すると図が複雑になるため一部省略)。
+[状態遷移マトリックス](#状態遷移マトリックス) の主な部分を下記に示す
 
-```dot
-digraph {
-  edge [dir=forward];
-  init -> active [label="ready"];
-  init -> aborted [label="cancel"];
-  active -> active [label="r/w"];
-  active -> committing [label="commit"];
-  active -> aborted [label="abort"];
-  active -> "going-to-abort" [label="cancel"];
-  committing -> committed [label="accept"];
-  committing -> aborted [label="reject,cancel"];
-  "going-to-abort" -> aborted [label="r/w, commit, abort, info"];
-  "going-to-abort" -> "going-to-abort" [label="cancel"];
-}
+```mermaid
+graph LR
+  init -- ready --> active
+  init -- "abort, cancel" --> aborted
+  active -- r/w (成功) --> active
+  active -- r/w (失敗) --> aborted
+  active -- "commit (同時実行タスクなし)" --> going-to-commit
+  active -- "commit (同時実行タスクあり)" --> going-to-abort
+  active -- "abort, cancel (同時実行タスクなし)" --> aborted
+  active -- "abort, cancel (同時実行タスクあり)" --> going-to-abort
+  going-to-commit -- cc_commit --> committing
+  committing -- accept --> committed
+  committing -- reject --> aborted
+  going-to-abort -- "task-empty" --> aborted
 ```
-
-(githubプレビューでは表示されない。Markdown Preview Enhanced を推奨)
-
